In [1]:
!python -m pip install pandas

Requirement already satisfied: pandas in c:\users\ritik\appdata\local\programs\python\python310\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ritik\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ritik\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\ritik\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\ritik\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.25.1)
Requirement already satisfied: six>=1.5 in c:\users\ritik\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
def print_(data):
    print(data, end='\n'+'*'*30+'\n')

Creation/Accessing/Deletion/Manipulation & Attributes
pd.Series([4,5,6])
pd.DataFrame([[3,4,5],[8,9,3]])
df.shape
df.ndim
s.dtype
df.size
df.values
********************************************
Data Description
df.info()
df.head()
df.tail()
df.sample(3)
df.describe()
df.value_counts()
s.unique()
s.nunique()
******************************************
Statistical Overview
s.min() / df
s.max() / df
s.std() / df
s.mean() / df
df.corr()
s.quantile(0.25)
s.idxmax()
s.idxmin()
*******************************
String Based Functions
Joining the Data
Sorting
Function Application
Iterations
Data Visualization
File Handling
Missing Data Treatment
Data Aggregation & Grouping

In [4]:
# Series: 1-D Data (Single Column)
# DataFrame: 2-D Data (Tabular/Multi-Column)
# Panel: 3-D Data (Multi Table Data) # Rarely required

In [5]:
s = pd.Series([1,8,5,6,4,7,8])
s

0    1
1    8
2    5
3    6
4    4
5    7
6    8
dtype: int64

In [6]:
# Attributes
print(type(s))
print(s.dtype)
print(s.shape)
print(s.ndim)
print(s.size)

<class 'pandas.core.series.Series'>
int64
(7,)
1
7

In [7]:
s1 = pd.Series([4,2,7,8,3,4,6,3,7,23,5,8],name = 'Data')
s1

0      4
1      2
2      7
3      8
4      3
5      4
6      6
7      3
8      7
9     23
10     5
11     8
Name: Data, dtype: int64

In [8]:
print_(s1[0]) # Accessing (Indexing)
print_(s1[:4]) # Slicing

s1[0] = 40      # Modify
print_(s1)

s1[12] = 50     # Insert
print_(s1)

del s1[5]       # Deletion
print_(s1)

4
******************************
0    4
1    2
2    7
3    8
Name: Data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      3
5      4
6      6
7      3
8      7
9     23
10     5
11     8
Name: Data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      3
5      4
6      6
7      3
8      7
9     23
10     5
11     8
12    50
Name: Data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      3
6      6
7      3
8      7
9     23
10     5
11     8
12    50
Name: Data, dtype: int64
******************************

In [9]:
s1 = pd.Series(['s','a','h','u'])
s1

0    s
1    a
2    h
3    u
dtype: object

In [10]:
pd.Series([[3,4,5,6],[4,6,7,3],[8,9,3,4]])

0    [3, 4, 5, 6]
1    [4, 6, 7, 3]
2    [8, 9, 3, 4]
dtype: object

In [11]:
s1 = pd.Series({'a':12,'b':23,'c':45})
s1

a    12
b    23
c    45
dtype: int64

In [13]:
print_(s1['a'])
print_(s1[0])

12
******************************
12
******************************

In [14]:
df = pd.DataFrame([1,2,3,4,5])
df

   0
0  1
1  2
2  3
3  4
4  5

In [15]:
df1 = pd.DataFrame([[2,3],[4,5],[8,6]])
df1

   0  1
0  2  3
1  4  5
2  8  6

In [16]:
print_(type(df1))
print_(df1.shape)
print_(df1.size)
# print_(df1.dtype)  # can't be obtained
print_(df1.ndim)

<class 'pandas.core.frame.DataFrame'>
******************************
(3, 2)
******************************
6
******************************
2
******************************

In [17]:
df2 = pd.DataFrame({
    'a':[34,67,89],
    'b':[45,99,100],
    'c':[67,0.45,93],
    'd':[89,9,0]
})
df2

    a    b      c   d
0  34   45  67.00  89
1  67   99   0.45   9
2  89  100  93.00   0

In [29]:
df3 = pd.DataFrame({
    'a':[34,67,89],
    'b':[45,'nice',100],
    'c':[67,0.45,93],
    'd':[89,9,0],
    'e':'nice'
})
df3

    a     b      c   d     e
0  34    45  67.00  89  nice
1  67  nice   0.45   9  nice
2  89   100  93.00   0  nice

In [30]:
# Accessing
print_(df3['a']) # Column
print_(df3.loc[0]) # Row
print_(df3.T)
print_(df3.T[0])
print_(df3.loc[:3])
print_(df3[['a','b']])

# bonus
print_(df3.values)

0    34
1    67
2    89
Name: a, dtype: int64
******************************
a      34
b      45
c    67.0
d      89
e    nice
Name: 0, dtype: object
******************************
      0     1     2
a    34    67    89
b    45  nice   100
c  67.0  0.45  93.0
d    89     9     0
e  nice  nice  nice
******************************
a      34
b      45
c    67.0
d      89
e    nice
Name: 0, dtype: object
******************************
    a     b      c   d     e
0  34    45  67.00  89  nice
1  67  nice   0.45   9  nice
2  89   100  93.00   0  nice
******************************
    a     b
0  34    45
1  67  nice
2  89   100
******************************
[[34 45 67.0 89 'nice']
 [67 'nice' 0.45 9 'nice']
 [89 100 93.0 0 'nice']]
******************************

In [31]:
df3['a'] = pd.Series([9,9,99])
df3

    a     b      c   d     e
0   9    45  67.00  89  nice
1   9  nice   0.45   9  nice
2  99   100  93.00   0  nice

In [32]:
del df3['d']
df3

    a     b      c     e
0   9    45  67.00  nice
1   9  nice   0.45  nice
2  99   100  93.00  nice

In [33]:
df3['a']

0     9
1     9
2    99
Name: a, dtype: int64

In [34]:

df3[['a']]

    a
0   9
1   9
2  99

In [35]:
df3

    a     b      c     e
0   9    45  67.00  nice
1   9  nice   0.45  nice
2  99   100  93.00  nice

In [37]:
# Data Description
print_(df3.info())
print_(df.head(2))
print_(df.tail(3))
print_(df.sample(2))
print_(df3.describe(include='all'))
print_(df.value_counts())
print_(s1.unique())
print_(s1.nunique())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      object
 2   c       3 non-null      float64
 3   e       3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes
None
******************************
   0
0  1
1  2
******************************
   0
2  3
3  4
4  5
******************************
   0
1  2
4  5
******************************
                a     b          c     e
count    3.000000   3.0   3.000000     3
unique        NaN   3.0        NaN     1
top           NaN  45.0        NaN  nice
freq          NaN   1.0        NaN     3
mean    39.000000   NaN  53.483333   NaN
std     51.961524   NaN  47.732597   NaN
min      9.000000   NaN   0.450000   NaN
25%      9.000000   NaN  33.725000   NaN
50%      9.000000   NaN  67.000000   NaN
75%     54.000000   NaN  80.000000   NaN
max     99.000000   NaN  93.000000   NaN
******************************
1    1
2    1
3    1
4    1
5    1
Name: count, dtype: int64
******************************
[12 23 45]
******************************
3
******************************

In [38]:
df.head(3)

   0
0  1
1  2
2  3

In [39]:
df.sample(4)

   0
0  1
1  2
4  5
2  3